---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase
source: html/f81dae71-9830-6ee9-d6a8-4125261a0637.htm
---
# CableTrayConduitRunBase Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.